mischief/nlos/esp32/sdkconfig.defaults
# T-Deck is an ESP32-S3-WROOM-1 N16R8: 16MB flash, 8MB octal PSRAM.
# qemu-esp32s3 emulates neither PSRAM mode, so a qemu run gets internal
# SRAM only and these settings simply find no chip -- which is why the
# port must not require PSRAM to reach a repl.
# The chip, named here and not left to idf.py's default.
#
# Without this a fresh build directory is configured for the original
# esp32: it compiles, links and produces an image, and the first sign of
# trouble is esptool refusing to flash a chip it does not match. The
# target used to arrive from a sdkconfig left over from an earlier
# build, which is not a thing a clean checkout has.
#
# esp32/sdkconfig.c5 names its own, as any other board file must.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# The app shares the flash with a filesystem: see esp32/partitions.csv
# for the layout and for why the offsets are written out.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# malloc draws on PSRAM for anything big, which is what puts the lua
# heaps there: src/luaheap.c allocates in ~8KB chunks, well over this
# threshold, while the small fry that wants to stay fast stays internal.
# Without it a proc costs ~52KB of the ~210KB of internal SRAM and the
# third proc cannot finish its requires -- which is the state qemu is
# permanently in, since it emulates no PSRAM at all.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# The console is where the two target machines genuinely disagree, and
# there is no single setting that serves both.
#
# On the T-Deck the console must be the native USB-Serial-JTAG: that is
# the /dev/ttyACM port. Making UART0 primary and USB secondary looks
# like it works -- the boot log still appears over USB, because output
# goes to both -- but stdin stays bound to UART0, which no cable
# reaches. Typing at the repl then does nothing and the host's write
# blocks once the CDC buffer fills.
#
# qemu is the opposite: it emulates the uart and not the USB
# peripheral, so a USB-primary image boot-loops there with no output at
# all, not even from the second-stage bootloader -- which makes it look
# like the app is at fault when nothing of ours has run yet.
#
# So this file is the board, and sdkconfig.qemu overrides it for the
# emulator. See tools/README or the qemu target for the invocation.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# kernel_run never returns and does its own idle sleep, so the watchdog
# has nothing to feed it. The scheduler yields to FreeRTOS on every idle
# lap (idf_shim's WaitForEvent), which is what keeps the idle task alive.
CONFIG_ESP_TASK_WDT_INIT=n

# lua wants a real stack: the parser recurses, and a proc's first
# require happens on app_main's.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# IDF talks at info level by default, which puts thirty lines of its own
# in front of the kernel's boot and hides what this machine reports
# about itself. Nothing here calls ESP_LOG -- the kernel writes through
# console_write -- so turning it down loses none of our own output, and
# a warning or an error still gets through.
#
# The strings are compiled out rather than merely filtered: there is no
# way to raise the level at runtime from here, so keeping them would
# spend flash on text nothing can ever print. Put these back to INFO
# and rebuild to see what the driver layer is doing.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_WARN=y

# The board this image is for. See esp32/main/Kconfig.projbuild: a
# peripheral probe that has no business running here does not merely
# answer no, it can hang before the kernel starts.
CONFIG_LUAOS_BOARD_TDECK=y

# Keep a 1bpp copy of the framebuffer, so fb.unload1 -- and so the
# ZMODEM screenshot in task/shot.lua -- can read the panel back. The
# glass itself cannot be read: the display's SDO is not routed. 9600
# bytes for this 320x240 panel, against 8MB of PSRAM.
CONFIG_LUAOS_FB_SHADOW=y

# 240MHz, the S3's top speed. A scroll is 16.0ms at 160 and 13.3 here,
# and the panel work that is pure transfer gains less.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# The clock drops to the XTAL when the machine is idle and returns when
# a driver takes a lock, which IDF's own drivers do. Measured cost is
# 10-13% on small panel rectangles, which wait on an interrupt, and
# nothing on large ones or on cpu. Light sleep needs TICKLESS_IDLE and
# is not on.
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# The BLE controller, and no host stack: lib/ble is the host stack, and
# NimBLE in the image is what it exists instead of. Controller-only
# publishes the VHCI pair the bundled hosts themselves sit on, so
# src/platform/esp32/ble.c moves whole HCI packets and nothing above.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y

# Activities are connections, scans and advertising sets together, and
# a mesh node wants several at once. 10 is the controller's ceiling and
# each costs 828 bytes of internal SRAM, which is the scarce kind here.
CONFIG_BT_CTRL_BLE_MAX_ACT=10
